package com.company.home_work.HW_Lesson_04;

/* 10 чисел наоборот
Вывести на экран числа от 10 до 1 используя цикл while.
*/
public class Test_04 {
    public static void main(String[] args) {

        int a = 10;
        while (a > 0) {
            System.out.println(a);
            a--;
        }

    }
}
